using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace WindowsFormsApplication10
{
    public partial class Form1 : Form
    {
        int day;
        public Form1()
        {
            InitializeComponent();
            monthCalendar1.Visible = false;
        }

        private void button1_Click(object sender, EventArgs e)
        {
            button1.Enabled = false;
            button2.Enabled = true;
            button3.Enabled = true;
            monthCalendar1.Visible = true;
            DateTime time = monthCalendar1.SelectionEnd;
            day = time.Day;
            SwitchChang(day);
           
        }
        private void button2_Click(object sender, EventArgs e)
        {
            button2.Enabled = false;
            button1.Enabled = true;
            button3.Enabled = true;
            monthCalendar1.Visible = true;
            DateTime time = monthCalendar1.SelectionEnd;
            day = time.Day;
            SwitchChang(day);
        }
        public void SwitchChang(int day)
        {
            if(button1.Enabled == false)
            {
                switch (Convert.ToString(day))
                {
                    case "1": label3.Text = ("อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "2": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน เพิ่มคารโบไฮเดตรขึ้น รวมอาหารที่ควรรับประทานแต่ละวันคือ 1600 กิโลแคลลอรี่ "); break;
                    case "3": label3.Text = (" อาหารทุกมื้อ เน้น ผัก และโปรตีน กินไขมันได้ แต่ไม่มาก  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1700 กิโลแคลลอรี่"); break;
                    case "4": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "5": label3.Text = (" อาหารทุกมื้อ เน้น ดื่มแอลกอฮอลได้ เป็นวันพักผ่อนของร่างกายผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1550 กิโลแคลลอรี่  "); break;
                    case "6": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "7": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และเนื้อ พิซซ่า ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "8": label3.Text = ("อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "9": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน เพิ่มคารโบไฮเดตรขึ้น รวมอาหารที่ควรรับประทานแต่ละวันคือ 1600 กิโลแคลลอรี่ "); break;
                    case "10": label3.Text = (" อาหารทุกมื้อ เน้น ผัก และโปรตีน กินไขมันได้ แต่ไม่มาก  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1700 กิโลแคลลอรี่"); break;
                    case "11": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "12": label3.Text = (" อาหารทุกมื้อ เน้น ดื่มแอลกอฮอลได้ เป็นวันพักผ่อนของร่างกายผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1550 กิโลแคลลอรี่  "); break;
                    case "13": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "14": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และเนื้อ พิซซ่า ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "15": label3.Text = ("อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "16": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน เพิ่มคารโบไฮเดตรขึ้น รวมอาหารที่ควรรับประทานแต่ละวันคือ 1600 กิโลแคลลอรี่ "); break;
                    case "17": label3.Text = (" อาหารทุกมื้อ เน้น ผัก และโปรตีน กินไขมันได้ แต่ไม่มาก  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1700 กิโลแคลลอรี่"); break;
                    case "18": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "19": label3.Text = (" อาหารทุกมื้อ เน้น ดื่มแอลกอฮอลได้ เป็นวันพักผ่อนของร่างกายผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1550 กิโลแคลลอรี่  "); break;
                    case "20": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "21": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และเนื้อ พิซซ่า ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "22": label3.Text = ("อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "23": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน เพิ่มคารโบไฮเดตรขึ้น รวมอาหารที่ควรรับประทานแต่ละวันคือ 1600 กิโลแคลลอรี่ "); break;
                    case "24": label3.Text = (" อาหารทุกมื้อ เน้น ผัก และโปรตีน กินไขมันได้ แต่ไม่มาก  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1700 กิโลแคลลอรี่"); break;
                    case "25": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "26": label3.Text = (" อาหารทุกมื้อ เน้น ดื่มแอลกอฮอลได้ เป็นวันพักผ่อนของร่างกายผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1550 กิโลแคลลอรี่  "); break;
                    case "27": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "28": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และเนื้อ พิซซ่า ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "29": label3.Text = ("อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน รวมอาหารที่ควรรับประทานแต่ละวันคือ 1500 กิโลแคลลอรี่"); break;
                    case "30": label3.Text = ("  อาหารทุกมื้อ เน้น ผัก และโปรตีน ไร้ไข้มัน เพิ่มคารโบไฮเดตรขึ้น รวมอาหารที่ควรรับประทานแต่ละวันคือ 1600 กิโลแคลลอรี่ "); break;
                    case "31": label3.Text = (" อาหารทุกมื้อ เน้น ผัก และโปรตีน กินไขมันได้ แต่ไม่มาก  รวมอาหารที่ควรรับประทานแต่ละวันคือ 1700 กิโลแคลลอรี่"); break;

                }

            }else if(button2.Enabled == false)
            {
                switch (Convert.ToString(day))
                {
                    case "1": label3.Text = (" เน้นการสร้างระบบการหายใจเวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก  นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "2": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที "); break;
                    case "3": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "4": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาทียืดให้นาน เซตเวลา 16.30 น วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯ"); break;
                    case "5": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ  16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  "); break;
                    case "6": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาที...ยืดให้นาน    ดันพื้น เซตละ 10 ครั้ง 5 เซต ซิตอัพ เซตละ 10 ครั้ง 8 เซตเวลา 16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งกลางแจ้ง 40 นาที ติดต่อกัน ไม่พัก ไม่เน้นความเร็ว ยืดเหยียดกล้ามเนื้อ  30 นาที วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯวิ่งสปีด 80 เปอร์เซ็นต์ ระยะ 30 เมตร 10 เที่ยว เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  พอสิ้นสุดของสัปดาห์ที่สอง นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "7": label3.Text = (" เน้นการสร้างระบบการหายใจ ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาที...ยืดให้นาน    ดันพื้น เซตละ 10 ครั้ง 5 เซต ซิตอัพ เซตละ 10 ครั้ง 8 เซตเวลา 16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งกลางแจ้ง 40 นาที ติดต่อกัน ไม่พัก ไม่เน้นความเร็ว ยืดเหยียดกล้ามเนื้อ  30 นาที วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯวิ่งสปีด 80 เปอร์เซ็นต์ ระยะ 30 เมตร 10 เที่ยว เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  พอสิ้นสุดของสัปดาห์ที่สอง นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "8": label3.Text = (" เน้นการสร้างระบบการหายใจเวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก  นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "9": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที "); break;
                    case "10": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "11": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาทียืดให้นาน เซตเวลา 16.30 น วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯ"); break;
                    case "12": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ  16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  "); break;
                    case "13": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาที...ยืดให้นาน    ดันพื้น เซตละ 10 ครั้ง 5 เซต ซิตอัพ เซตละ 10 ครั้ง 8 เซตเวลา 16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งกลางแจ้ง 40 นาที ติดต่อกัน ไม่พัก ไม่เน้นความเร็ว ยืดเหยียดกล้ามเนื้อ  30 นาที วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯวิ่งสปีด 80 เปอร์เซ็นต์ ระยะ 30 เมตร 10 เที่ยว เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  พอสิ้นสุดของสัปดาห์ที่สอง นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "14": label3.Text = (" เน้นการสร้างระบบการหายใจ ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาที...ยืดให้นาน    ดันพื้น เซตละ 10 ครั้ง 5 เซต ซิตอัพ เซตละ 10 ครั้ง 8 เซตเวลา 16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งกลางแจ้ง 40 นาที ติดต่อกัน ไม่พัก ไม่เน้นความเร็ว ยืดเหยียดกล้ามเนื้อ  30 นาที วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯวิ่งสปีด 80 เปอร์เซ็นต์ ระยะ 30 เมตร 10 เที่ยว เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  พอสิ้นสุดของสัปดาห์ที่สอง นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "15": label3.Text = (" เน้นการสร้างระบบการหายใจเวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก  นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "16": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที "); break;
                    case "17": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "18": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาทียืดให้นาน เซตเวลา 16.30 น วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯ"); break;
                    case "19": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ  16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  "); break;
                    case "20": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาที...ยืดให้นาน    ดันพื้น เซตละ 10 ครั้ง 5 เซต ซิตอัพ เซตละ 10 ครั้ง 8 เซตเวลา 16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งกลางแจ้ง 40 นาที ติดต่อกัน ไม่พัก ไม่เน้นความเร็ว ยืดเหยียดกล้ามเนื้อ  30 นาที วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯวิ่งสปีด 80 เปอร์เซ็นต์ ระยะ 30 เมตร 10 เที่ยว เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  พอสิ้นสุดของสัปดาห์ที่สอง นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "21": label3.Text = (" เน้นการสร้างระบบการหายใจ ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาที...ยืดให้นาน    ดันพื้น เซตละ 10 ครั้ง 5 เซต ซิตอัพ เซตละ 10 ครั้ง 8 เซตเวลา 16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งกลางแจ้ง 40 นาที ติดต่อกัน ไม่พัก ไม่เน้นความเร็ว ยืดเหยียดกล้ามเนื้อ  30 นาที วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯวิ่งสปีด 80 เปอร์เซ็นต์ ระยะ 30 เมตร 10 เที่ยว เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  พอสิ้นสุดของสัปดาห์ที่สอง นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "22": label3.Text = (" เน้นการสร้างระบบการหายใจเวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก  นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "23": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที "); break;
                    case "24": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "25": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาทียืดให้นาน เซตเวลา 16.30 น วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯ"); break;
                    case "26": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ  16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  "); break;
                    case "27": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาที...ยืดให้นาน    ดันพื้น เซตละ 10 ครั้ง 5 เซต ซิตอัพ เซตละ 10 ครั้ง 8 เซตเวลา 16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งกลางแจ้ง 40 นาที ติดต่อกัน ไม่พัก ไม่เน้นความเร็ว ยืดเหยียดกล้ามเนื้อ  30 นาที วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯวิ่งสปีด 80 เปอร์เซ็นต์ ระยะ 30 เมตร 10 เที่ยว เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  พอสิ้นสุดของสัปดาห์ที่สอง นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "28": label3.Text = (" เน้นการสร้างระบบการหายใจ ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที ติดต่อกันยืดเหยียดกล้ามเนื้อ 30 นาที...ยืดให้นาน    ดันพื้น เซตละ 10 ครั้ง 5 เซต ซิตอัพ เซตละ 10 ครั้ง 8 เซตเวลา 16.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย...วิ่งกลางแจ้ง 40 นาที ติดต่อกัน ไม่พัก ไม่เน้นความเร็ว ยืดเหยียดกล้ามเนื้อ  30 นาที วิ่งสเต็ป เช่น วิ่งยกเข่าสูง เข่าต่ำ สไลด์ข้าง ดีดส้น ฯลฯวิ่งสปีด 80 เปอร์เซ็นต์ ระยะ 30 เมตร 10 เที่ยว เล่นฟุตบอลโดยเน้นการรับส่ง เคาะบอลง่ายๆ ไม่เน้นการพาบอล กระชากลากเลื้อยปฏิบัติเช่นนี้ทุกวัน  พอสิ้นสุดของสัปดาห์ที่สอง นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "29": label3.Text = (" เน้นการสร้างระบบการหายใจเวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก  นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                    case "30": label3.Text = ("  ฟื้นฟูสภาพกล้ามเนื้อให้แข็งแรง  เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อยวิ่งจ๊อกกิ้งติดต่อกันไม่พัก ใช้ความเร็วน้อย...30 นาที "); break;
                    case "31": label3.Text = (" เน้นการสร้างระบบการหายใจ   เวลา 05.30 น.ยืดเหยียดกล้ามเนื้อเล็กน้อย นักฟุตบอลผู้ฝึกซ้อมจะรู้สึกกระฉับกระเฉง คล่องตัวขึ้น"); break;
                }
            }else if(button3.Enabled == false)
            {
                switch (Convert.ToString(day))
                {
                    case "1": label3.Text = (" พักผ่อน "); break;
                    case "2": label3.Text = (" คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง "); break;
                    case "3": label3.Text = (" พักผ่อน"); break;
                    case "4": label3.Text = ("   คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง"); break;
                    case "5": label3.Text = (" พักผ่อน  "); break;
                    case "6": label3.Text = ("   คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง"); break;
                    case "7": label3.Text = ("  พักผ่อน"); break;
                    case "8": label3.Text = (" พักผ่อน "); break;
                    case "9": label3.Text = (" คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง "); break;
                    case "10": label3.Text = (" พักผ่อน"); break;
                    case "11": label3.Text = ("   คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง"); break;
                    case "12": label3.Text = (" พักผ่อน  "); break;
                    case "13": label3.Text = ("   คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง"); break;
                    case "14": label3.Text = ("  พักผ่อน"); break;
                    case "15": label3.Text = (" พักผ่อน "); break;
                    case "16": label3.Text = (" คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง "); break;
                    case "17": label3.Text = (" พักผ่อน"); break;
                    case "18": label3.Text = ("   คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง"); break;
                    case "19": label3.Text = (" พักผ่อน  "); break;
                    case "20": label3.Text = ("   คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง"); break;
                    case "21": label3.Text = ("  พักผ่อน"); break;
                    case "22": label3.Text = (" พักผ่อน "); break;
                    case "23": label3.Text = (" คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง "); break;
                    case "24": label3.Text = (" พักผ่อน"); break;
                    case "25": label3.Text = ("   คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง"); break;
                    case "26": label3.Text = (" พักผ่อน  "); break;
                    case "27": label3.Text = ("   คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง"); break;
                    case "28": label3.Text = ("  พักผ่อน"); break;
                    case "29": label3.Text = (" พักผ่อน "); break;
                    case "30": label3.Text = (" คาบ ฝึก1 8.00 น.-9.00 น. ฝึกอก และ ไหล่ คาบฝึกที่ 2 ฝึก 16.00 น - 17.00 น. ฝึกต้นขา และน่อง "); break;
                    case "31": label3.Text = (" พักผ่อน"); break;

                }
            }
        }
        private void button3_Click(object sender, EventArgs e)
        {
            button2.Enabled = true;
            button1.Enabled = true;
            button3.Enabled = false;
            monthCalendar1.Visible = true;
            DateTime time = monthCalendar1.SelectionEnd;
            day = time.Day;
            SwitchChang(day);
        }

        private void monthCalendar1_DateChanged(object sender, DateRangeEventArgs e)
        {
            DateTime time = monthCalendar1.SelectionEnd;
            day = time.Day;
            SwitchChang(day);
        }
    }
}
